app/controllers/videos_controller.rb

  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save
---
INSERT INTO "videos" ("title", "description", "duration", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    @video.destroy
---
DELETE FROM "videos" WHERE "videos"."id" = ?  [["id", 2]]